app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  @task = Task.find_by(id: params[:id])

INSERT INTO "tasks" ("name", "description", "deadline", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "testing"], ["description", "testing"], ["deadline", "2024-03-30"], ["completed", 0], ["created_at", "2024-03-30 04:22:57.990985"], ["updated_at", "2024-03-30 04:22:57.990985"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save